app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  ORDER BY "comments"."created_at" DESC  [["post_id", 3]]
---
    <h2>対応履歴</h2>
    <% @post.comments.each do |comment| %>