app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "テストです"], ["post_id", 3], ["user_id", 1], ["created_at", "2015-12-07 05:00:20.155265"], ["updated_at", "2015-12-07 05:00:20.155265"]]
---
  def create
    @comment = Comment.new(comment_params)
    @comment.save