app/controllers/posts_controller.rb

  def index
    # @posts = Post.all
    @posts = Post.order(created_at: :desc)
---
SELECT "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC

  def create
    @post = Post.new(post_params)
    if @post.save
---
INSERT INTO "posts" ("title", "category", "body", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    if @post.update(post_params)
---
UPDATE "posts" SET "image" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["image", "gingatetudou.jpg"], ["updated_at", "2015-11-27 07:01:53.468134"], ["id", 1]]